# CannotPasteDifferentViewSpecificElements Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CopyPasteFailures..::..CannotPasteDifferentViewSpecificElements Property
BuiltInFailures..::..CopyPasteFailures Class See Also
---
Cannot paste view-specific elements from different views.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotPasteDifferentViewSpecificElements { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotPasteDifferentViewSpecificElements As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotPasteDifferentViewSpecificElements {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CopyPasteFailures Class
Autodesk.Revit.DB Namespace